satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Utilities/STM32_EVAL/STM32_SGN101/stm32_st7565_lcd.c
/******************************************************************************/
/**
*
* @file     stm32_st7565_lcd.c
* @brief    The LCD driver for the ST7565.
* @author   Satish Nair
* @date     09/2010
*
**/
/******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "stm32_st7565_lcd.h"
#include "stm32_st7565_fonts.h"

/* Private define ------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Global variables to set the written text color */
static __IO uint16_t TextColor = LCD_COLOR_TEXT_NORMAL;

/* External variable ---------------------------------------------------------*/
/* Public variables ---------------------------------------------------------*/
GPIO_InitTypeDef             GPIO_InitStructure;

/******************************* Basic Important LCD Routines **********************************/
/* Private function prototypes -----------------------------------------------*/
#ifdef USE_Delay
extern void Delay(__IO uint32_t nCount);
#else
static void delay(__IO uint32_t nCount);
#endif /* USE_Delay*/

static void LCD_DataLinesConfig( DataConfigMode_TypeDef Mode );
static void LCD_DataLinesWrite( GPIO_TypeDef* GPIOx, uint32_t PortVal );
static uint32_t LCD_DataLinesRead( GPIO_TypeDef* GPIOx );
static void LCD_CtrlLinesConfig( void );
static void LCD_CtrlLinesWrite( GPIO_TypeDef* GPIOx, uint32_t CtrlPins, BitAction BitVal );
static void LCD_ST7565_Controller( void );

/* Private functions ---------------------------------------------------------*/
#ifndef USE_Delay
/**
  * @brief  Inserts a delay time.
  * @param  nCount: specifies the delay time length.
  * @retval None
  */
static void delay(__IO uint32_t nCount)
{
  __IO uint32_t index = 0; 
  for(index = (100000 * nCount); index != 0; index--)
  {
  }
}
#endif /* USE_Delay*/

/*******************************************************************************
*
*                                LCD_BackLightConfig
*
*******************************************************************************/
/**
*  Setting of the PWM that drives the backlight intensity.
*
**/
/******************************************************************************/
void LCD_BackLightConfig( void )
{
    TIM_TimeBaseInitTypeDef      TIM_TimeBaseStructure;
    TIM_OCInitTypeDef            TIM_OCInitStructure;

    /* Enable GPIO clock  */
    RCC_APB2PeriphClockCmd( GPIO_LCD_BACKLIGHT_PERIPH | RCC_APB2Periph_AFIO, ENABLE );

    /* GPIO Configuration : TIM in Output */
    GPIO_InitStructure.GPIO_Pin   = LCD_BACKLIGHT_PIN;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init( GPIOx_LCD_BACKLIGHT, &GPIO_InitStructure );

    /* Disable TIM clock */
    RCC_APB1PeriphClockCmd( RCC_APB1Periph_TIM2, ENABLE );

    /* -----------------------------------------------------------------------------------
    TIM2 Configuration: generate 1 PWM signal with variable Duty cycle on CH4.
    TIM2CLK = SystemCoreClock = 2 * APB1 freq (if APB1 prescaler == 2)
    TIM2CLK = SystemCoreClock = APB1 freq (if APB1 prescaler == 1)
    To get TIM2 counter clock = 100 KHz,
     - Prescaler = (TIM2CLK / TIM2 counter clock) - 1 = (72000000 / 100000) - 1
    SystemCoreClock is set to 72 MHz for Low-density, Medium-density, High-density
    and Connectivity line devices and to 24 MHz for Low-Density Value line and
    Medium-Density Value line devices

    The TIM2 is running at 1000 Hz:
    TIM2 Frequency = TIM3 counter clock / (ARR + 1)
                   = 100000 / 100 = 1000 Hz
    TIM2 Channel4 duty cycle = (TIM2_CCR4 / (TIM2_ARR + 1)) * 100 = (50 / 100) * 100 = 50 %
    ------------------------------------------------------------------------------------- */
    /* Time base configuration */
    TIM_TimeBaseStructure.TIM_Period          = 99; //TIM period = 1000Hz, autoreload = (100000 / 1000) - 1
    TIM_TimeBaseStructure.TIM_Prescaler       = (SystemCoreClock / 100000) - 1; //TIM counter clock = 100000 Hz 
    TIM_TimeBaseStructure.TIM_ClockDivision   = 0x0000; //0
    TIM_TimeBaseStructure.TIM_CounterMode     = TIM_CounterMode_Up;
    
    TIM_TimeBaseInit( TIM2, &TIM_TimeBaseStructure );

    /* PWM1 Mode configuration: Channel2 */
    TIM_OCInitStructure.TIM_OCMode      = TIM_OCMode_PWM1;
    TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
    TIM_OCInitStructure.TIM_Pulse       = 0x0000;   //Backlight-Off
    TIM_OCInitStructure.TIM_OCPolarity  = TIM_OCPolarity_High;

    TIM_OC4Init( TIM2, &TIM_OCInitStructure );

    TIM_OC4PreloadConfig( TIM2, TIM_OCPreload_Disable );

    TIM_ARRPreloadConfig( TIM2, DISABLE );

    /* TIM2 disable counter */
    TIM_Cmd( TIM2, DISABLE );
    
    /* Disable TIM2 clock */
    RCC_APB1PeriphClockCmd( RCC_APB1Periph_TIM2, DISABLE );    
}

/*******************************************************************************
*
*                                LCD_SetBackLight
*
*******************************************************************************/
/**
*  Modify the LCD Backlight PWM Duty cycle.
*
**/
/******************************************************************************/
void LCD_SetBackLight( uint8_t Brightness )
{
    uint16_t CCR4_Value = ((Brightness * 99) / 100); //Brightness = Duty_Cycle, TIM2_Autoreload = 99

    if(Brightness)
    {
        /* Enable TIM2 clock */
        RCC_APB1PeriphClockCmd( RCC_APB1Periph_TIM2, ENABLE );

        /* TIM2 enable counter */
        TIM_Cmd( TIM2, ENABLE );    
    
        /* Set Timer2 channel2 duty cycle */
        TIM_SetCompare4(TIM2, CCR4_Value);
    }
    else
    {
        /* Set Timer2 channel2 duty cycle */
        TIM_SetCompare4(TIM2, CCR4_Value);
    
        /* TIM2 disable counter */
        TIM_Cmd( TIM2, DISABLE );
        
        /* Disable TIM2 clock */
        RCC_APB1PeriphClockCmd( RCC_APB1Periph_TIM2, DISABLE );
    }
}

