satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Utilities/STM32_EVAL/STM32_SGN101/stm32_st7565_lcd.c
/*******************************************************************************
*
*                               LCD_DataLinesConfig
*
*******************************************************************************/
/**
*  Configure data lines D0~D7 in Input Floating mode for read from LCD or in
*  Output Push-Pull mode for write on LCD
*
*  @param[in]  Mode Specifies the configuration mode for data lines D0~D7.
*                @n @c Input: configure in Input Floating mode
*                @n @c Output: configure in Output Push-Pul mode
*
**/
/******************************************************************************/
static void LCD_DataLinesConfig( DataConfigMode_TypeDef Mode )
{
    GPIO_InitStructure.GPIO_Pin   =  LCD_DATA_PINS;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;

    if( Mode == Input )
    {
        /* Configure D0~D7 lines as Input */
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    }
    else
    {
        /* Configure D0~D7 lines in Output Push-Pull mode */
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    }

    GPIO_Init( GPIOx_LCD_DATA, &GPIO_InitStructure );
}

/*******************************************************************************
*
*                                LCD_DataLinesWrite
*
*******************************************************************************/
/**
*  Write a value on D0~D7
*
*  @param[in]  GPIOx    GPIO port to write on.
*  @param[in]  PortVal  The value to write. Only the lowest OR highest 8 bits are taken into
*                       account depending on hardware.
*
**/
/******************************************************************************/
static void LCD_DataLinesWrite( GPIO_TypeDef* GPIOx, uint32_t PortVal )
{
    /* Write only the lowest 8 bits! */
    GPIOx->ODR = ( (GPIOx->ODR) & 0xFF00 ) | (uint8_t)PortVal;
    // /* Write only the highest 8 bits! */
    // GPIOx->ODR = ((GPIOx->ODR) & 0x00FF) | (((uint8_t)PortVal) << 8);
}

/*******************************************************************************
*
*                                LCD_DataLinesRead
*
*******************************************************************************/
/**
*  Read a value from D0~D7
*
*  @param[in]  GPIOx    GPIO port to read from.
*
**/
/******************************************************************************/
static uint32_t LCD_DataLinesRead( GPIO_TypeDef* GPIOx )
{
    /* Read only the lowest 8 bits! */
    return (((uint16_t)GPIOx->IDR) & 0x00FF);
    // /* Read only the highest 8 bits! */
    // return ((((uint16_t)GPIOx->IDR) & 0xFF00) >> 8);
}

/*******************************************************************************
*
*                                LCD_CtrlLinesConfig
*
*******************************************************************************/
/**
*  Configure control lines in Output Push-Pull mode.
*
**/
/******************************************************************************/
static void LCD_CtrlLinesConfig( void )
{
#if defined (USE_SD_CARD_SDIO_INTERFACE)
    /* Disable JTAG-DP and Enable SW-DP */
    GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);
#endif

    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;

    GPIO_InitStructure.GPIO_Pin   =  CtrlPin_RST;
    GPIO_Init( GPIOx_LCD_CTRL_RST, &GPIO_InitStructure );
    GPIO_InitStructure.GPIO_Pin   =  CtrlPin_CS;
    GPIO_Init( GPIOx_LCD_CTRL_CS, &GPIO_InitStructure );
    GPIO_InitStructure.GPIO_Pin   =  CtrlPin_RS;
    GPIO_Init( GPIOx_LCD_CTRL_RS, &GPIO_InitStructure );
    GPIO_InitStructure.GPIO_Pin   =  CtrlPin_RD;
    GPIO_Init( GPIOx_LCD_CTRL_RD, &GPIO_InitStructure );
    GPIO_InitStructure.GPIO_Pin   =  CtrlPin_WR;
    GPIO_Init( GPIOx_LCD_CTRL_WR, &GPIO_InitStructure );

    LCD_CtrlLinesWrite( GPIOx_LCD_CTRL_RS, CtrlPin_RS,  Bit_SET );    /* RS = 1   */
    LCD_CtrlLinesWrite( GPIOx_LCD_CTRL_RD, CtrlPin_RD,  Bit_SET );    /* RD = 1   */
    LCD_CtrlLinesWrite( GPIOx_LCD_CTRL_CS, CtrlPin_CS,  Bit_SET );    /* CS = 1   */
    LCD_CtrlLinesWrite( GPIOx_LCD_CTRL_WR, CtrlPin_WR,  Bit_SET );    /* WR = 1   */
    LCD_CtrlLinesWrite( GPIOx_LCD_CTRL_RST, CtrlPin_RST, Bit_RESET );  /* RST = 0  */
}

/*******************************************************************************
*
*                                LCD_CtrlLinesWrite
*
*******************************************************************************/
/**
*  Set or reset control lines.
*
*  @param[in]  GPIOx       Where x can be 0, 1 or 2 to select the GPIO peripheral.
*  @param[in]  CtrlPins    The Control line.
*  @param[in]  BitVal
*
**/
/******************************************************************************/
static void LCD_CtrlLinesWrite( GPIO_TypeDef* GPIOx, uint32_t CtrlPins, BitAction BitVal )
{
    /* Set or Reset the control line */
    GPIO_WriteBit( GPIOx, CtrlPins, BitVal );
}

/*******************************************************************************
*
*                                LCD_ST7565_Controller
*
*******************************************************************************/
/**
*  Initialization of the controller registers.
*
**/
/******************************************************************************/
static void LCD_ST7565_Controller( void )
{
    /** Apply hardware reset **/
    LCD_CtrlLinesWrite( GPIOx_LCD_CTRL_RST, CtrlPin_RST, Bit_SET );    /* RST = 1  */
    LCD_CtrlLinesWrite( GPIOx_LCD_CTRL_RST, CtrlPin_RST, Bit_RESET );  /* RST = 0  */
    _delay_(50);    /* delay 500ms */
    LCD_CtrlLinesWrite( GPIOx_LCD_CTRL_RST, CtrlPin_RST, Bit_SET );    /* RST = 1  */
    _delay_(50);    /* delay 500ms */

    /*default mode is output*/
    LCD_DataLinesConfig( Output );

    // LCD_CheckLCDStatus();

    /* Software Reset */
    LCD_SendLCDCmd(0xE2);   //$E2 Resets Internal functions
    /* LCD bias set */
    LCD_SendLCDCmd(0xA2);  //Bias: $A2 Set bias 1/9 (Duty 1/65)
    /* ADC set */
    LCD_SendLCDCmd(0xA0);  //ADC Direction: $A1 ADC reverse, $A0 ADC normal
    /* Common output mode select */
    LCD_SendLCDCmd(0xC0);  //SHL/COM Output Scan Direction: $C0 Normal COM0->COM63, $C8 Reverse COM63->COM0
    /* V0 voltage regulator set */
    LCD_SendLCDCmd(0x25);  //Voltage ref: $20 to $27
    /* Electronic volume mode set */
    LCD_SendLCDCmd(0x81);  //Volume mode: $81
    LCD_SendLCDCmd(0x18);  //Volume set:  $00 to $3F
    /* Power control set */
    LCD_SendLCDCmd(0x2F);  //$2F Booster, Regulator and Follower on
    /* Static indicator set */
    LCD_SendLCDCmd(0xAC);  //$AC No indicator
    LCD_SendLCDCmd(0x00);  //$00 No indicator

    /* Display start line set */
    LCD_SendLCDCmd(0x40);  //Initial display line: $40 Display start line 0
    /* Display normal/reverse */
    LCD_SendLCDCmd(0xA6);  //Normal display: $A6 Display normal    
    /* Display ON/OFF */
    LCD_SendLCDCmd(0xAF);  //turn display on: $AF Display on

    /* Page address set */
    LCD_SendLCDCmd(0xB0);   //page address = 0
    /* Column address set */
    LCD_SendLCDCmd(0x10);   //column address high = 0, send MSB nibble
    LCD_SendLCDCmd(0x00);   //column address low = 0, send LSB nibble
    // /* Do not increment Column address counter during Read operation */
    // LCD_SendLCDCmd(0xE0);   //issue RMW
    
    /* Clear LCD */
    LCD_Clear(LCD_COLOR_WHITE);        
}

