satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Utilities/STM32_EVAL/STM32_SGN101/stm32_st7565_lcd.c
/*******************************************************************************
*
*                                LCD_Init
*
*******************************************************************************/
/**
*
*  Initialize LCD.
*
**/
/******************************************************************************/
void LCD_Init( void )
{
    /* Enable GPIO clock for LCD */
    RCC_APB2PeriphClockCmd( GPIO_LCD_CTRL_RST_PERIPH | GPIO_LCD_CTRL_CS_PERIPH | GPIO_LCD_CTRL_RS_PERIPH |
                            GPIO_LCD_CTRL_RD_PERIPH | GPIO_LCD_CTRL_WR_PERIPH, ENABLE );
    RCC_APB2PeriphClockCmd( GPIO_LCD_DATA_PERIPH, ENABLE );

    /* LCD Init */
    /* Configure control lines signals as output mode */
    LCD_CtrlLinesConfig();
    /* ST7565 init */
    LCD_ST7565_Controller();
}

/* Public functions ----------------------------------------------------------*/

/*******************************************************************************
*
*                                LCD_SendLCDCmd
*
*******************************************************************************/
/**
*
*  Send on command byte to the LCD.
*
*  @param[in]  Cmd   An uint8_t containing the user command to send to the LCD.
*
**/
/******************************************************************************/
void LCD_SendLCDCmd( uint8_t Cmd )
{
    /* Start the LCD send data sequence */
    LCD_CtrlLinesWrite( GPIOx_LCD_CTRL_RS, CtrlPin_RS, Bit_RESET );     /* RS = 0 */
    LCD_CtrlLinesWrite( GPIOx_LCD_CTRL_RD, CtrlPin_RD, Bit_SET );       /* RD = 1 */
    LCD_CtrlLinesWrite( GPIOx_LCD_CTRL_CS, CtrlPin_CS, Bit_RESET );     /* CS = 0 */
    LCD_CtrlLinesWrite( GPIOx_LCD_CTRL_WR, CtrlPin_WR, Bit_RESET );     /* WR = 0 */

    /* Write data to the LCD */
    LCD_DataLinesWrite( GPIOx_LCD_DATA, (uint32_t)Cmd );
    LCD_CtrlLinesWrite( GPIOx_LCD_CTRL_WR, CtrlPin_WR, Bit_SET );       /* WR = 1 */
}

/*******************************************************************************
*
*                                LCD_SendLCDData
*
*******************************************************************************/
/**
*
*  Send one data byte to the LCD.
*
*  @param[in]  Data  An unsigned character containing the data to send to the LCD.
*  @pre        An LCD_SendLCDCmd was done with a command waiting for data.
*
*
**/
/******************************************************************************/
void LCD_SendLCDData( uint8_t Data )
{
    /* Configure Data lines as Output */
    LCD_CtrlLinesWrite( GPIOx_LCD_CTRL_RS, CtrlPin_RS, Bit_SET );
    LCD_CtrlLinesWrite( GPIOx_LCD_CTRL_RD, CtrlPin_RD, Bit_SET );
    LCD_CtrlLinesWrite( GPIOx_LCD_CTRL_CS, CtrlPin_CS, Bit_RESET );
    LCD_CtrlLinesWrite( GPIOx_LCD_CTRL_WR, CtrlPin_WR, Bit_RESET );

    /* Write data to the LCD */
    LCD_DataLinesWrite( GPIOx_LCD_DATA,(uint32_t)Data );
    LCD_CtrlLinesWrite( GPIOx_LCD_CTRL_WR, CtrlPin_WR, Bit_SET );
}

/***********************************************************************************
*
*                                LCD_ReadLCDData
*
************************************************************************************/
/**
*
*  Read one data byte from the LCD.
*
*  @return     An unsigned 8 bit byte containing the data returned by a LCD command.
*  @pre        An LCD_SendLCDCmd was done with a command returning data.
*
**/
/********************************************************************************/
uint8_t LCD_ReadLCDData( void )
{
    uint32_t LCDData = 0;

    /* Configure Data lines as Input */
    LCD_DataLinesConfig(Input);

    /* Start the LCD send data sequence */
    LCD_CtrlLinesWrite( GPIOx_LCD_CTRL_RS, CtrlPin_RS, Bit_SET );         /* RS = 1 */
    LCD_CtrlLinesWrite( GPIOx_LCD_CTRL_WR, CtrlPin_WR, Bit_SET );         /* WR = 1 */
    LCD_CtrlLinesWrite( GPIOx_LCD_CTRL_CS, CtrlPin_CS, Bit_RESET );          /* CS = 0 */
    LCD_CtrlLinesWrite( GPIOx_LCD_CTRL_RD, CtrlPin_RD, Bit_RESET );       /* RD = 0 */

    /* Read data from the LCD */
    // LCDData = (GPIO_ReadInputData( GPIOx_LCD_DATA ) & LCD_DATA_PINS );
    LCDData = LCD_DataLinesRead(GPIOx_LCD_DATA);

    LCD_CtrlLinesWrite( GPIOx_LCD_CTRL_RD, CtrlPin_RD, Bit_SET );          /* RD = 1 */

    /* Read the LCD returned data */
    LCD_DataLinesConfig( Output );

    return (uint8_t)LCDData;
}

// /**
  // * @brief  Sets the cursor position.
  // * @param  Xpos: specifies the X position.
  // * @param  Ypos: specifies the Y position. 
  // * @retval None
  // */
// void LCD_SetCursor(uint16_t Xpos, uint16_t Ypos)
// {
    // /* set Y position / set page address*/
    // LCD_SendLCDCmd(0xB0 | ((Ypos>>3) % (LCD_HEIGHT/8)));

    // /* set X position / set column address */
    // LCD_SendLCDCmd(0x10 | (((Xpos % LCD_WIDTH) >> 4) & 0x0F));    //First send MSB nibble
    // LCD_SendLCDCmd(0x00 | ((Xpos % LCD_WIDTH) & 0x0F));   //Then send LSB nibble
// }

/**
  * @brief  Clears the whole LCD.
  * @param  color: the color of the background.
  * @retval None
  */
void LCD_Clear(uint16_t color)
{
    uint8_t p, c; 
    for(p = 0; p < 8; p++)
    {
        LCD_SendLCDCmd(0xB0 | p);
        LCD_SendLCDCmd(0x10 | ((0x00 >> 4) & 0x0F));
        LCD_SendLCDCmd(0x00 | (0x00 & 0x0F));

        for(c = 0; c < LCD_WIDTH; c++)
        {
            LCD_SendLCDData((uint8_t)color);
        }     
    }
}

uint16_t LCD_GetPixel(uint8_t x, uint8_t y)
{
    LCD_SendLCDCmd(0xB0 | (y >> 3));   //y/8
    LCD_SendLCDCmd(0x10 | (x >> 4));
    LCD_SendLCDCmd(x & 0x0F);  
    LCD_SendLCDCmd(0xE0);   //issue RMW
    LCD_ReadLCDData();  //dummy read
    if(LCD_ReadLCDData() & (1 << (y % 8)))   //if((LCD_ReadLCDData() >> (y % 8)) & 1)
        return LCD_COLOR_BLACK;
    else
        return LCD_COLOR_WHITE;
    LCD_SendLCDCmd(0xEE);   //release RMW 
}

void LCD_DrawPixel(uint8_t x, uint8_t y, uint16_t color)
{
    LCD_SendLCDCmd(0xB0 | (y >> 3));   //y/8
    LCD_SendLCDCmd(0x10 | (x >> 4));
    LCD_SendLCDCmd(x & 0x0F);  
    LCD_SendLCDCmd(0xE0);   //issue RMW
    LCD_ReadLCDData();  //dummy read
    if(color)
        LCD_SendLCDData(LCD_ReadLCDData() | (1 << (y % 8)));  //Set Pixel
    else
        LCD_SendLCDData(LCD_ReadLCDData() & ~(1 << (y % 8))); //Clear Pixel
    LCD_SendLCDCmd(0xEE);   //release RMW 
}

/**
* @brief  Sets the Text color.
* @param  Color: specifies the Text color(Normal / Reverse).
* @retval None
*/
void LCD_SetTextColor(__IO uint16_t Color)
{
    TextColor = Color;
}

/**
* @brief  Displays one character (6dots width, 7dots height).
* @param  Line: the Line where to display the character shape .
*   This parameter can be one of the following values:
*     @arg Linex: where x can be 0..7
* @param  Column: start column address.
* @param  Ascii: character ascii code, must be between 0x20 and 0x7E.
* @retval None
*/
void LCD_DisplayChar(uint8_t Line, uint8_t Column, uint8_t Ascii)
{
    LCD_SendLCDCmd(0xB0 | Line);
    LCD_SendLCDCmd(0x10 | (Column >> 4));
    LCD_SendLCDCmd(Column & 0x0F);  
    uint8_t c = 0;
    for(c = 0; c < LCD_FONT_WIDTH; c++)
    {
        if(TextColor)
            LCD_SendLCDData(ASCII6x7_Table[((Ascii - 32) * LCD_FONT_WIDTH) + c]);//Normal: black text on white background
        else
            LCD_SendLCDData(~(ASCII6x7_Table[((Ascii - 32) * LCD_FONT_WIDTH) + c]));//Reverse: white text on black background           
    }
}

