satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Utilities/STM32_EVAL/STM32_SGN101/stm32_st7565_lcd.c
void LCD_DisplayStringLineColumn(uint8_t Line, uint16_t Column, uint8_t *ptr, int8_t Length)
{
    int8_t i = 0;
    uint16_t refcolumn = Column;
    /* Send the string character by character on lCD */
    while (refcolumn < LCD_WIDTH)
    {
        if((Length >= 0) && (i >= Length))
        break;

        if(*ptr != 0)
        {
            /* Display one character on LCD */
            LCD_DisplayChar(Line, refcolumn, *ptr);
            /* Point on the next character */
            ptr++;
        }
        else
        {
            LCD_DisplayChar(Line, refcolumn, ' ');
        }
        /* Increment the column position by the current font width */
        refcolumn += LCD_FONT_WIDTH;
        /* Increment character count */
        i++;
    }
}

/**
* @brief  Displays a maximum of 20 char on the LCD.
* @param  Line: the Line where to display the character shape .
*   This parameter can be one of the following values:
*     @arg Linex: where x can be 0..7
* @param  *ptr: pointer to string to display on LCD.
* @retval None
*/
void LCD_DisplayStringLine(uint8_t Line, uint8_t *ptr)
{
    // uint16_t refcolumn = 0;
    // /* Send the string character by character on lCD */
    // while (refcolumn < LCD_WIDTH)
    // {
        // if(*ptr != 0)
        // {
            // /* Display one character on LCD */
            // LCD_DisplayChar(Line, refcolumn, *ptr);
            // /* Point on the next character */
            // ptr++;
        // }
        // else
        // {
            // LCD_DisplayChar(Line, refcolumn, ' ');
        // }
        // /* Increment the column position by the current font width */
        // refcolumn += FONT_WIDTH;
    // }

    LCD_DisplayStringLineColumn(Line, LCD_COLUMN_0, ptr, 20);
}

/**
* @brief  Clears the selected line.
* @param  Line: the Line to be cleared.
*   This parameter can be one of the following values:
*     @arg Linex: where x can be 0..n
* @retval None
*/
void LCD_ClearLine(uint8_t Line)
{
    // uint16_t refcolumn = 0;   
    // /* Send the string character by character on lCD */
    // while (refcolumn < LCD_WIDTH)
    // {
        // /* Display one character on LCD */
        // LCD_DisplayChar(Line, refcolumn, ' ');
        // /* Increment the column position by the current font width */
        // refcolumn += LCD_FONT_WIDTH;
    // }

    LCD_DisplayStringLineColumn(Line, LCD_COLUMN_0, "                    ", 20);
}
/***********************************************************************************************/

/********************************* Low Level Drawing Utilities *********************************/
/* Display Image */
void LCD_DisplayImage(const uint8_t* imageptr, uint8_t x, uint8_t y, uint8_t width, uint8_t height)
{
    uint8_t p, c; 
    uint8_t pStart, pEnd;

    pStart = (y >> 3);
    pEnd = ((y + height) >> 3);

    for(p = pStart; p < pEnd; p++)
    {
        LCD_SendLCDCmd(0xB0 | p);
        LCD_SendLCDCmd(0x10 | (x >> 4));
        LCD_SendLCDCmd(x & 0x0F);

        for(c = 0; c < width; c++)
        {
            LCD_SendLCDData(*imageptr++);
        }     
    }
}

/**
*  Draw a line on the LCD screen. Optimized for horizontal/vertical lines,
*  and use the Bresenham algorithm for other cases.
**/
void LCD_DrawLine(uint8_t x1, uint8_t y1, uint8_t x2, uint8_t y2, uint16_t color)
{
    int32_t i, dx, dy;
    int32_t sdx, sdy, dxabs, dyabs;
    int32_t x, y, px, py;

    #define abs(X) ( ( (X) < 0 ) ? -(X) : (X) )
    #define sgn(X) ( ( (X) < 0 ) ? -1 : 1 )

    if ( x1 == x2 )        /* Vertical Line*/
    {
        if ( y1 > y2 )    /* We assume y2>y1 and invert if not*/
        {
            i = y2;
            y2 = y1;
            y1 = i;
        }
        LCD_FillRect( x1, y1, 1, y2 - y1 + 1, color );
        return;
    }
    else if ( y1 == y2 )  /* Horizontal Line*/
    {
        if ( x1 > x2 )   /* We assume x2>x1 and we swap them if not*/
        {
            i = x2;
            x2 = x1;
            x1 = i;
        }
        LCD_FillRect( x1, y1, x2 - x1 + 1, 1, color );
        return;
    }

    dx = x2 - x1;      /* the horizontal distance of the line */
    dy = y2 - y1;      /* the vertical distance of the line */
    dxabs = abs( dx );
    dyabs = abs( dy );
    sdx = sgn( dx );
    sdy = sgn( dy );
    x = dyabs >> 1;
    y = dxabs >> 1;
    px = x1;
    py = y1;

    if ( dxabs >= dyabs ) /* the line is more horizontal than vertical */
    {
        for(i = 0; i < dxabs; i++)
        {
            y += dyabs;
            if (y >= dxabs)
            {
                y -= dxabs;
                py += sdy;
            }
            px += sdx;
            LCD_DrawPixel(px, py, color);
        }
    }
    else /* the line is more vertical than horizontal */
    {
        for(i = 0; i < dyabs; i++)
        {
            x += dxabs;
            if (x >= dyabs)
            {
                x -= dyabs;
                px += sdx;
            }
            py += sdy;
            LCD_DrawPixel(px, py, color);
        }
    }
}

/* Draw a Rectangle */
void LCD_DrawRect(uint8_t x, uint8_t y, uint8_t width, uint8_t height, uint16_t color)
{
    /* Draw horizontal sides.*/
    LCD_FillRect( x, y,              width, 1, color );
    LCD_FillRect( x, y + height - 1, width, 1, color );

    /* Draw vertical sides.*/
    LCD_FillRect( x,              y, 1, height, color );
    LCD_FillRect( x + width - 1,  y, 1, height, color );
}

/* Filled Rectangle */
void LCD_FillRect(uint8_t x, uint8_t y, uint8_t width, uint8_t height, uint16_t color)
{
    uint8_t i = y;
    uint8_t j = 0;

    while(i < (y + height))
    {
        if((i % 8) || ((i + 8) > (y + height)))
        {
            LCD_SendLCDCmd(0xB0 | (i >> 3));
            LCD_SendLCDCmd(0x10 | (x >> 4));
            LCD_SendLCDCmd(x & 0x0F);  
            LCD_SendLCDCmd(0xE0);   //issue RMW      
            for(j = 0; j < width; j++)
            {
                LCD_ReadLCDData();  //dummy read
                if(color)
                    LCD_SendLCDData(LCD_ReadLCDData() | (1 << (i % 8)));  //Set Pixel
                else
                    LCD_SendLCDData(LCD_ReadLCDData() & ~(1 << (i % 8))); //Clear Pixel
            }            
            LCD_SendLCDCmd(0xEE);   //release RMW        
            i++; 
        }
        else
        {
            LCD_SendLCDCmd(0xB0 | (i >> 3));
            LCD_SendLCDCmd(0x10 | (x >> 4));
            LCD_SendLCDCmd(x & 0x0F);  
            for(j = 0; j < width; j++)
            {  
                LCD_SendLCDData((uint8_t)color);  
            }                    
            i += 8;
        }
    }
}

// /* Filled Rectangle */
// void LCD_FillRect(uint8_t x, uint8_t y, uint8_t width, uint8_t height, uint16_t color)
// {
    // uint8_t i = 0, p = 0, c = 0; 
    // uint8_t pStart = 0, pEnd = 0;
    // uint8_t pData = 0x00, pStartData = 0x00, pEndData = 0x00;

