satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Utilities/STM32_EVAL/STM32_SGN101/stm32_st7565_lcd.c
    // pStart = (y >> 3);
    // pEnd = ((y + height) >> 3);
    
    // if(pStart == pEnd)
    // {
        // p = pStart;
        // for(i = y; i < y + height; i++)
        // {
            // pData = (pData | (1 << (i % 8)));
        // }
        // LCD_SendLCDCmd(0xB0 | p);
        // LCD_SendLCDCmd(0x10 | (x >> 4));
        // LCD_SendLCDCmd(x & 0x0F);
        // LCD_SendLCDCmd(0xE0);   //issue RMW
        // for(c = 0; c < width; c++)
        // {
            // LCD_ReadLCDData();  //dummy read
            // if(color)
                // LCD_SendLCDData(LCD_ReadLCDData() | pData);
            // else
                // LCD_SendLCDData(LCD_ReadLCDData() & ~pData);            
        // }
        // LCD_SendLCDCmd(0xEE);   //release RMW
        // return;
    // }

    // switch(y % 8)
    // {
        // case 0:
            // pStartData = 0xFF;
            // break;
        // case 1:
            // pStartData = 0xFE;
            // break;
        // case 2:
            // pStartData = 0xFC;
            // break;
        // case 3:
            // pStartData = 0xF8;
            // break;
        // case 4:
            // pStartData = 0xF0;
            // break;
        // case 5:
            // pStartData = 0xE0;
            // break;
        // case 6:
            // pStartData = 0xC0;
            // break;
        // case 7:
            // pStartData = 0x80;
            // break;
    // }

    // switch((y + height) % 8)
    // {
        // case 0:
            // pEndData = 0x00;
            // break;
        // case 1:
            // pEndData = 0x01;
            // break;
        // case 2:
            // pEndData = 0x03;
            // break;
        // case 3:
            // pEndData = 0x07;
            // break;
        // case 4:
            // pEndData = 0x0F;
            // break;
        // case 5:
            // pEndData = 0x1F;
            // break;
        // case 6:
            // pEndData = 0x3F;
            // break;
        // case 7:
            // pEndData = 0x7F;
            // break;
    // }

    // for(p = pStart; p < (pEnd + 1); p++)
    // {
        // LCD_SendLCDCmd(0xB0 | p);
        // LCD_SendLCDCmd(0x10 | (x >> 4));
        // LCD_SendLCDCmd(x & 0x0F);
        // LCD_SendLCDCmd(0xE0);   //issue RMW
        // for(c = 0; c < width; c++)
        // {
            // if(color)
            // {
                // if(p == pStart)
                // {
                    // LCD_ReadLCDData();  //dummy read
                    // LCD_SendLCDData(LCD_ReadLCDData() | pStartData);
                // }
                // else if(p == pEnd)
                // {
                    // LCD_ReadLCDData();  //dummy read
                    // LCD_SendLCDData(LCD_ReadLCDData() | pEndData);
                // }
                // else
                // {
                    // LCD_SendLCDData(0xFF);
                // }
            // }
            // else
            // {
                // if(p == pStart)
                // {
                    // LCD_ReadLCDData();  //dummy read
                    // LCD_SendLCDData(LCD_ReadLCDData() & ~pStartData);
                // }
                // else if(p == pEnd)
                // {
                    // LCD_ReadLCDData();  //dummy read
                    // LCD_SendLCDData(LCD_ReadLCDData() & ~pEndData);
                // }
                // else
                // {
                    // LCD_SendLCDData(0x00);
                // }
            // }
        // }    
        // LCD_SendLCDCmd(0xEE);   //release RMW  
    // }
// }

/* Draw a Circle Outline */
// void LCD_DrawCircle(uint8_t x0, uint8_t y0, uint8_t r, uint16_t color)
// {
// }

// /* Filled Circle */
// void LCD_FillCircle(uint8_t x0, uint8_t y0, uint8_t r, uint16_t color)
// {
// }
/***********************************************************************************************/

/*********************** Drawing Utilities Using "LCD_DrawPixel" Method ************************/
// /* Display Image */
// void LCD_DisplayImage(const uint8_t* imageptr, uint8_t x, uint8_t y, uint8_t width, uint8_t height)
// {
// }

// /* Draw a Line - bresenham's algorithm */
// void LCD_DrawLine(uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1, uint16_t color)
// {
    // uint8_t steep = abs(y1 - y0) > abs(x1 - x0);
    // if (steep)
    // {
        // swap(x0, y0);
        // swap(x1, y1);
    // }

    // if (x0 > x1) 
    // {
        // swap(x0, x1);
        // swap(y0, y1);
    // }

    // uint8_t dx, dy;
    // dx = x1 - x0;
    // dy = abs(y1 - y0);

    // int8_t err = dx / 2;
    // int8_t ystep;

    // if (y0 < y1)
    // {
        // ystep = 1;
    // }
    // else
    // {
        // ystep = -1;
    // }

    // for (; x0<x1; x0++)
    // {
        // if (steep) 
        // {
            // LCD_DrawPixel(y0, x0, color);
        // } 
        // else 
        // {
            // LCD_DrawPixel(x0, y0, color);
        // }
        // err -= dy;
        // if (err < 0)
        // {
            // y0 += ystep;
            // err += dx;
        // }
    // }
// }

// /* Draw a Rectangle */
// void LCD_DrawRect(uint8_t x, uint8_t y, uint8_t width, uint8_t height, uint16_t color)
// {
    // uint8_t i = 0;
    // for (i=x; i<x+width; i++)
    // {
        // LCD_DrawPixel(i, y, Color);
        // LCD_DrawPixel(i, y+height-1, color);
    // }
    // for (i=y; i<y+height; i++)
    // {
        // LCD_DrawPixel(x, i, Color);
        // LCD_DrawPixel(x+width-1, i, color);
    // } 
// }

// /* Filled Rectangle */
// void LCD_FillRect(uint8_t x, uint8_t y, uint8_t width, uint8_t height, uint16_t color)
// {
    // uint8_t i = 0, j = 0;
    // for (i=x; i<x+width; i++)
    // {
        // for (j=y; j<y+height; j++) 
        // {
            // LCD_DrawPixel(i, j, color);
        // }
    // }
// }

/* Draw a Circle Outline */
void LCD_DrawCircle(uint8_t x0, uint8_t y0, uint8_t r, uint16_t color)
{
    int8_t f = 1 - r;
    int8_t ddF_x = 1;
    int8_t ddF_y = -2 * r;
    int8_t x = 0;
    int8_t y = r;

    LCD_DrawPixel(x0, y0+r, color);
    LCD_DrawPixel(x0, y0-r, color);
    LCD_DrawPixel(x0+r, y0, color);
    LCD_DrawPixel(x0-r, y0, color);

    while (x<y)
    {
        if (f >= 0) 
        {
            y--;
            ddF_y += 2;
            f += ddF_y;
        }
        x++;
        ddF_x += 2;
        f += ddF_x;

        LCD_DrawPixel(x0 + x, y0 + y, color);
        LCD_DrawPixel(x0 - x, y0 + y, color);
        LCD_DrawPixel(x0 + x, y0 - y, color);
        LCD_DrawPixel(x0 - x, y0 - y, color);

        LCD_DrawPixel(x0 + y, y0 + x, color);
        LCD_DrawPixel(x0 - y, y0 + x, color);
        LCD_DrawPixel(x0 + y, y0 - x, color);
        LCD_DrawPixel(x0 - y, y0 - x, color);
    }
}

/* Filled Circle */
void LCD_FillCircle(uint8_t x0, uint8_t y0, uint8_t r, uint16_t color)
{
    int8_t f = 1 - r;
    int8_t ddF_x = 1;
    int8_t ddF_y = -2 * r;
    int8_t x = 0;
    int8_t y = r;
    uint8_t i = 0;

    for (i=y0-r; i<=y0+r; i++)
    {
        LCD_DrawPixel(x0, i, color);
    }

    while (x<y)
    {
        if (f >= 0) 
        {
            y--;
            ddF_y += 2;
            f += ddF_y;
        }
        x++;
        ddF_x += 2;
        f += ddF_x;

        for (i=y0-y; i<=y0+y; i++) 
        {
            LCD_DrawPixel(x0+x, i, color);
            LCD_DrawPixel(x0-x, i, color);
        } 
        for (i=y0-x; i<=y0+x; i++) 
        {
            LCD_DrawPixel(x0+y, i, color);
            LCD_DrawPixel(x0-y, i, color);
        }    
    }
}
/***********************************************************************************************/
